Tekla.Structures.ModelInternal.ControlSpline
The ControlSpline class defines a user defined spline helping in modeling work.

Tekla.Structures.ModelInternal.ControlSpline.InconsistentSplineMessage
Message that will be given as a descriptor of the exceptions thrown by this object

Tekla.Structures.ModelInternal.ControlSpline.#ctor
Creates a new empty control spline instance.

Tekla.Structures.ModelInternal.ControlSpline.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Vector})
Creates a new control spline instance with the given images and slopes. The slope list may be empty.
imagePoints: Collection of points to fit the spline to
slopes: Collection of slopes to be applied at the image points. Must have the same size
as the point collection or be empty (which applies the default slopes)
Throws System.ArgumentException: Throws when the slopes are inconsistent with the amount of points

Tekla.Structures.ModelInternal.ControlSpline.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})
Creates a new control spline instance with the given images and default slopes.
imagePoints: Collection of points to fit the spline to
Throws System.ArgumentException: Throws when the slopes are inconsistent with the amount of points

Tekla.Structures.ModelInternal.ControlSpline.Color
Gets or sets color of the control spline.

Tekla.Structures.ModelInternal.ControlSpline.LineType
Gets or sets the line type of the control spline.

Tekla.Structures.ModelInternal.ControlSpline.ImagePoints
Gets or sets the image points of the spline (i.e. the points picked by the user)

Tekla.Structures.ModelInternal.ControlSpline.Slopes
Gets or sets the slopes at the corresponding image points. If empty, they will be automatically computed upon insertion.

Tekla.Structures.ModelInternal.ControlSpline.Delete
Deletes the control spline with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.Insert
Inserts the control spline into the model.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.Modify
Modifies the control spline with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.Select
Selects the control spline with the given Identifier.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.ToStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Method for object conversion from dotNet to core.
SplineStruct: Struct containing the spline data

Tekla.Structures.ModelInternal.ControlSpline.FromStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Method for object conversion from core to dotNet.
SplineStruct: Struct containing the spline data

Tekla.Structures.ModelInternal.ControlSpline.CreateInstance
Method for creation of the object.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.SelectInstance
Method for selection of the object.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.ModifyInstance
Method for modifying the object.
Returns: True on success, false otherwise.

Tekla.Structures.ModelInternal.ControlSpline.IsSplineConsistent
Checks whether or not the amount of slopes given is consistent with the number of points, and whether
there are points in the spline
Returns: True if the spline is consistent, false otherwise